cases/field_scale/10Mar1500UT_R09/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;
/*
simulationType  RAS;

RAS
{
    RASModel        kOmegaWilcox2006Stab;

    turbulence      on;

    printCoeffs     on;

    kOmegaWilcox2006StabCoeffs
    {
        alphaBS     1.356;
        lambda2     0.05;
        Clim        0.2;
    }

}
*/
// ************************************************************************* //
