cases/field_scale/10Mar1500UT_R09/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        irregular;

genAbs          1;

absDir          0.0;

nPaddles        1;

secondOrder     0; 

tSmooth         2;

waveHeights
256
(
0.01124
0.01068
0.01008
0.00945
0.00877
0.00803
0.00722
0.00646
0.00642
0.00638
0.00634
0.00631
0.00627
0.00623
0.00619
0.00615
0.00611
0.00608
0.00604
0.00600
0.00596
0.00592
0.00588
0.00583
0.00579
0.00575
0.00638
0.00878
0.01065
0.01224
0.01364
0.01492
0.01609
0.01718
0.02140
0.02966
0.03608
0.04152
0.04633
0.05068
0.05469
0.05842
0.06193
0.06466
0.06637
0.06804
0.06967
0.07127
0.07282
0.07435
0.07584
0.07686
0.07508
0.07327
0.07140
0.06949
0.06752
0.06550
0.06341
0.06124
0.06001
0.05887
0.05771
0.05652
0.05531
0.05407
0.05280
0.05150
0.05017
0.04880
0.04739
0.04593
0.04443
0.04288
0.04127
0.03959
0.03784
0.03716
0.03661
0.03605
0.03548
0.03491
0.03432
0.03373
0.03312
0.03259
0.03268
0.03277
0.03286
0.03296
0.03305
0.03314
0.03323
0.03332
0.03330
0.03325
0.03319
0.03313
0.03307
0.03301
0.03295
0.03289
0.03283
0.03246
0.03205
0.03163
0.03122
0.03079
0.03036
0.02993
0.02942
0.02867
0.02790
0.02711
0.02630
0.02546
0.02459
0.02369
0.02275
0.02210
0.02233
0.02254
0.02276
0.02297
0.02319
0.02340
0.02361
0.02381
0.02356
0.02307
0.02257
0.02206
0.02154
0.02101
0.02046
0.01990
0.01932
0.01944
0.01983
0.02020
0.02057
0.02093
0.02128
0.02163
0.02197
0.02280
0.02370
0.02456
0.02539
0.02619
0.02697
0.02773
0.02847
0.02919
0.02862
0.02787
0.02710
0.02631
0.02550
0.02466
0.02379
0.02288
0.02231
0.02214
0.02196
0.02179
0.02161
0.02143
0.02125
0.02106
0.02088
0.02087
0.02094
0.02101
0.02107
0.02114
0.02121
0.02127
0.02134
0.02140
0.02119
0.02088
0.02056
0.02025
0.01992
0.01959
0.01926
0.01892
0.01857
0.01822
0.01786
0.01750
0.01712
0.01674
0.01634
0.01594
0.01593
0.01639
0.01683
0.01727
0.01769
0.01810
0.01851
0.01890
0.01929
0.01955
0.01958
0.01960
0.01963
0.01966
0.01968
0.01971
0.01973
0.01967
0.01938
0.01908
0.01877
0.01846
0.01814
0.01782
0.01749
0.01716
0.01726
0.01780
0.01832
0.01882
0.01932
0.01980
0.02027
0.02073
0.02131
0.02204
0.02275
0.02344
0.02410
0.02475
0.02539
0.02601
0.02661
0.02696
0.02718
0.02740
0.02762
0.02783
0.02805
0.02826
0.02847
0.02863
0.02863
0.02863
0.02863
0.02863
0.02863
0.02863
0.02863
0.02863
);

wavePeriods
256
(
62.16006
55.79701
50.61571
46.31491
42.68775
39.58745
36.90699
34.56650
32.50516
30.67583
29.04144
27.57239
26.24481
25.03920
23.93949
22.93231
22.00646
21.15247
20.36228
19.62901
18.94671
18.31025
17.71516
17.15753
16.63394
16.14136
15.67711
15.23882
14.82438
14.43187
14.05962
13.70609
13.36990
13.04981
12.74468
12.45350
12.17533
11.90931
11.65467
11.41069
11.17671
10.95214
10.73642
10.52903
10.32949
10.13739
9.95229
9.77384
9.60167
9.43546
9.27491
9.11973
8.96966
8.82444
8.68386
8.54768
8.41571
8.28775
8.16362
8.04316
7.92620
7.81259
7.70220
7.59488
7.49051
7.38897
7.29014
7.19393
7.10022
7.00892
6.91994
6.83319
6.74859
6.66606
6.58552
6.50690
6.43014
6.35517
6.28193
6.21036
6.14040
6.07199
6.00510
5.93966
5.87563
5.81297
5.75163
5.69158
5.63276
5.57515
5.51870
5.46339
5.40917
5.35602
5.30390
5.25279
5.20265
5.15346
5.10520
5.05782
5.01132
4.96567
4.92084
4.87681
4.83357
4.79108
4.74934
4.70831
4.66799
4.62835
4.58938
4.55107
4.51338
4.47632
4.43986
4.40398
4.36869
4.33395
4.29976
4.26611
4.23298
4.20036
4.16824
4.13661
4.10545
4.07476
4.04452
4.01473
3.98538
3.95645
3.92794
3.89984
3.87213
3.84482
3.81789
3.79134
3.76515
3.73932
3.71384
3.68871
3.66391
3.63945
3.61531
3.59149
3.56798
3.54477
3.52187
3.49926
3.47694
3.45490
3.43314
3.41165
3.39043
3.36947
3.34877
3.32833
3.30813
3.28817
3.26845
3.24897
3.22972
3.21069
3.19189
3.17331
3.15494
3.13679
3.11884
3.10110
3.08355
3.06621
3.04905
3.03209
3.01532
2.99873
2.98232
2.96610
2.95004
2.93416
2.91845
2.90291
2.88753
2.87232
2.85726
2.84236
2.82761
2.81302
2.79858
2.78428
2.77013
2.75613
2.74226
2.72853
2.71494
2.70149
2.68816
2.67497
2.66191
2.64897
2.63616
2.62347
2.61091
2.59846
2.58613
2.57392
2.56182
2.54984
2.53797
2.52620
2.51455
2.50300
2.49156
2.48022
2.46899
2.45786
2.44682
2.43589
2.42505
2.41431
2.40366
2.39311
2.38265
2.37228
2.36200
2.35181
2.34171
2.33169
2.32176
2.31191
2.30214
2.29246
2.28286
2.27334
2.26390
2.25453
2.24525
2.23604
2.22690
2.21784
2.20885
2.19994
2.19109
2.18232
2.17362
2.16499
2.15642
2.14792
2.13949
2.13113
2.12283
2.11459
2.10642
2.09831
2.09027
2.08228
2.07436
2.06649
);

wavePhases
256
(
3.05
1.50
3.09
3.00
1.35
4.87
4.54
3.62
1.66
4.03
1.15
1.49
2.90
2.67
4.86
6.27
3.89
3.83
3.00
1.95
2.25
0.02
0.52
5.25
3.85
0.48
3.10
0.50
5.92
2.86
2.71
0.82
0.10
0.79
3.93
2.20
5.54
3.08
2.81
0.84
3.36
1.15
6.04
0.86
2.05
5.64
5.58
4.16
2.74
6.19
4.69
2.94
1.38
4.90
2.07
4.49
0.45
2.58
1.95
3.51
0.33
2.77
3.89
4.53
0.17
3.28
0.23
2.84
1.54
1.62
2.81
4.26
3.80
1.37
6.14
6.06
2.94
3.11
3.19
4.57
5.63
0.46
5.84
1.34
1.76
5.67
2.46
6.17
5.24
4.13
3.53
4.81
1.93
0.49
1.60
0.22
5.76
3.05
4.38
4.24
0.07
3.85
4.71
2.85
0.08
2.96
5.30
1.19
3.57
5.64
1.09
1.71
3.29
4.80
5.93
3.32
1.20
5.91
6.15
6.00
1.53
1.00
6.25
2.85
6.23
3.99
0.69
1.21
4.57
3.05
1.81
4.44
0.31
5.50
3.67
3.78
0.52
4.39
4.91
1.04
5.56
6.03
0.34
1.81
5.54
4.59
0.84
0.42
1.11
2.60
5.72
1.58
0.92
4.66
5.46
1.72
2.21
2.54
4.53
4.34
0.42
5.08
2.48
3.05
0.71
1.39
2.12
1.66
3.28
5.70
0.77
5.59
2.54
5.72
0.99
1.91
1.21
5.19
1.82
5.09
4.12
2.22
3.81
4.05
4.50
5.88
0.67
5.73
4.43
2.68
2.34
4.34
4.08
3.90
0.68
4.60
1.60
5.96
1.57
3.39
3.89
1.44
3.41
5.22
4.27
6.05
5.23
1.89
1.42
4.03
0.41
2.92
0.67
3.27
6.17
2.75
5.96
2.50
1.05
2.13
2.37
0.65
4.23
2.23
1.17
4.01
3.86
3.83
5.42
2.14
4.91
3.11
3.09
5.99
4.86
1.33
3.41
5.94
2.63
5.59
0.70
2.09
3.37
5.57
5.14
5.34
6.09
2.12
0.27
0.25
3.61
4.29
0.73
4.68
4.65
4.08
);

waveDirs
256
{
0
};

// ************************************************************************* //
