cases/field_scale/10Mar1500UT_R09/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);
writeControl    writeTime;

interpolationScheme cellPoint;

setFormat raw;

sets
(
    lineVert
    {
        type        face;
        axis        xyz;
        start       (0.809 0.05 0.0);
        end         (0.809 0.05 0.5);
     }
);

fields          (U);


// ************************************************************************* //
